# AddUpdatingSharedParameter Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarFreeFormAccessor..::..AddUpdatingSharedParameter Method
RebarFreeFormAccessor Class See Also
---
Add existing shared parameter as a dependency for the calculation of the rebar curves.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2020
# Syntax
C#
---
```text
public void AddUpdatingSharedParameter(
	ElementId parameterId
)
```

Visual Basic
---
```text
Public Sub AddUpdatingSharedParameter ( _
	parameterId As ElementId _
)
```

Visual C++
---
```text
public:
void AddUpdatingSharedParameter(
	ElementId^ parameterId
)
```

# ### Parameters
parameterId
    Type: Autodesk.Revit.DB..::..ElementId ElementId of the shared parameter to be added.
# Remarks
The input parameter needs to be bound to the Rebar element
The rebar element needs to have a valid external server
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. -or- parameterId is a parameter that is not bound to the Rebar element category. |

# See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace